#!/usr/bin/env python
# coding=utf-8
"""
  Create at 17:57 on 2020/3/15
"""

# 目录
# an -> 1
# o -> 14
# key 概念，这个概念相当于目录里面的索引
# value 就是和 key 是一一对应
a = {}  # 空字典
# 空字符串 '' "" """""" ''''''
# 空元组 ()
# 空列表 []
#   { key1:value1, key2:value2 }
a = {"土豆土豆我是地瓜": "明天就是16号"}
b = {"word": "单词", "world": "世界", "me": "我", }
print(b.keys())
print(b.values())
print(b["word"])  # a[0]
print(b.get("you"))
c = {"word": "单词", "word": "词汇", "word": "词语"}  # 一对多
print(c)
d = {"单词": 'word', "词汇": "word", "词语": "word"} # 多对一
print(d)
a = {}  # 图书馆还没买书，所以图书目录就是空
#                (书架号，第几排，第几位）
a["人性的弱点"] = (1, 1, 1)
print(a.get("人性的弱点"))
print(a.get("人性的优点"))
a["人性的优点"] = (1, 1, 2)
print(a)
a.pop("人性的弱点")
print(a)

"""
习题一：选出下面是字典的变量
a = [1,2,3]
b = (1,2)
c = {'1': 1, '2': 2}
"""

"""
习题二：按照下面提示的步骤写出代码
"""
# 定义一个空字典
a = {}
# 给这个字典添加一个同学，小明，他的座位号是 12 号
a["小明"] = 12
print(a)

# 给这个字典添加一个同学，小范，他的座位号是 23 号
a["小范"] = 23

# 打印这个字典里面名字叫做小丽的同学的座位号
print(a.get("小丽"))

# 小明将从这个班级转到另一个班级，怎么把他从这个班级信息里面删除掉
print(a)
a.pop("小明")
print(a)
